Tekla.Structures.Model.ModelObject.GetAllUserProperties(System.Collections.Hashtable@)
Retrieves all properties for the model object in one hashtable.
Type for the returned value must be checked using type casting.
values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.